public class AllSolution {
}
/*
- Объединить k отсортированные списки

- Определить есть ли цикл в связанном списке

- Вам даны два непустых связанных списка, представляющих два неотрицательных целых числа.
Цифры хранятся в обратном порядке , и каждый из их узлов содержит одну цифру.
Добавьте два числа и верните сумму в виде связанного списка.
Ввод: l1 = [2,4,3], l2 = [5,6,4]
 Вывод: [7,0,8]
 Объяснение: 342 + 465 = 807.

- Перевернуть односвязный список. Учитывая head односвязный список, переверните список и верните перевернутый список.

-Дан массив целых чисел nums, отсортированных в порядке возрастания, и целое число target,
напишите функцию для поиска target в nums. Если target существует, верните его индекс. В противном случае возвращайтесь -1.

-Мы играем в игру «Угадай». Игра выглядит следующим образом: Я выбираю число от 1 до n. Вы должны угадать, какое число я выбрал.

- Поиск 2D-матрицы

- Поиск в отсортированном массиве с поворотом

- Найти минимум в отсортированном массиве с поворотом с уникальными элементами

- Поиск в отсортированном массиве с поворотом с повторяющимися элементами

- Учитывая непустой  массив целых чисел nums, каждый элемент встречается дважды , кроме одного. Найди ту единственную.

- Дан массив целых чисел nums и целое число target, вернуть индексы двух чисел так, чтобы они в сумме составляли target .

- Учитывая массив nums целых nчисел, верните массив всех уникальных четверок, [nums[a], nums[b], nums[c], nums[d]];

- Учитывая массив строк strs, сгруппируйте анаграммы вместе. Вы можете вернуть ответ в любом порядке.

- Даны две строки s и t, вернуть, true если t это анаграмма s, и false в противном случае.

- Учитывая две строки s и p, вернуть массив всех начальных индексов pанаграмм в s . Вы можете вернуть ответ в любом порядке.

- Учитывая строку s, содержащую только символы '(', ')', '{', и '}', определите, допустима ли входная строка.'['']'

-Учитывая m x n двумерную двоичную сетку grid, которая представляет карту '1's (суша) и '0's (вода),
верните число островов.

*  */
